---
kind: type
id: T:Autodesk.Revit.DB.Events.ElementTypeDuplicatingEventArgs
source: html/a507c83d-21c0-badf-ee5d-f5e4c76886a8.htm
---
# Autodesk.Revit.DB.Events.ElementTypeDuplicatingEventArgs

The event arguments used by the ElementTypeDuplicating event.

## Syntax (C#)
```csharp
public class ElementTypeDuplicatingEventArgs : RevitAPIPreDocEventArgs
```